-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: helldiverproject
-- ------------------------------------------------------
-- Server version	9.0.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `tb_equipment_detail`
--

DROP TABLE IF EXISTS `tb_equipment_detail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_equipment_detail` (
  `detail_id` int NOT NULL AUTO_INCREMENT,
  `equip_id` int NOT NULL COMMENT '무기 번호',
  `proj_type` int DEFAULT '0' COMMENT '예) 오토캐논 : 1. 대공포, 2. 철갑탄 등등...',
  `proj_name` varchar(100) NOT NULL DEFAULT '기본',
  `normal_dmg` int DEFAULT NULL COMMENT '일반 데미지',
  `durable_dmg` int DEFAULT NULL COMMENT '내구 데미지',
  `ap` int DEFAULT NULL COMMENT '장갑관통력: 1. 무장갑, 2. 경장갑, 3. 일반장갑, 4. 중장갑, 5. 대전차',
  `effect_type` int DEFAULT NULL COMMENT '무기 데미지 속성 : 0.없음, 1. 화염, 2. 산성, 3, 아크, 4. 가스, 5, 출혈, 6. 파편, 7. 근접, 8. 폭발',
  `effect_dmg` int DEFAULT NULL COMMENT '폭발데미지 및 속성데미지 표기',
  `effect_durable_dmg` int DEFAULT NULL COMMENT '폭발데미지 및 속성데미지의 내구데미지',
  `eap` int DEFAULT NULL COMMENT '폭발데미지 및 속성데미지의 장갑관통력',
  `note` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`detail_id`),
  KEY `equip_id` (`equip_id`),
  CONSTRAINT `tb_equipment_detail_ibfk_1` FOREIGN KEY (`equip_id`) REFERENCES `tb_equipment` (`equip_id`)
) ENGINE=InnoDB AUTO_INCREMENT=102 DEFAULT CHARSET=utf8mb3 COMMENT='헬다이버즈 2 무기 상세내역';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_equipment_detail`
--

LOCK TABLES `tb_equipment_detail` WRITE;
/*!40000 ALTER TABLE `tb_equipment_detail` DISABLE KEYS */;
INSERT INTO `tb_equipment_detail` VALUES (1,1,0,'기본',70,15,2,0,0,0,0,''),(2,2,0,'기본',60,15,3,0,0,0,0,''),(3,3,0,'기본',65,30,2,0,0,0,0,''),(4,4,0,'기본',70,15,2,0,0,0,0,''),(5,5,0,'기본',95,22,2,0,0,0,0,''),(6,6,0,'기본',90,23,3,0,0,0,0,''),(7,7,0,'기본',70,15,2,0,0,0,0,''),(8,8,0,'기본',180,50,3,7,110,55,3,''),(9,9,0,'기본',165,45,2,0,0,0,0,''),(10,10,0,'기본',200,50,3,0,0,0,0,''),(11,11,0,'기본',250,125,3,8,100,100,3,''),(12,12,0,'기본',65,7,2,0,0,0,0,''),(13,13,0,'기본',65,7,2,0,0,0,0,''),(14,14,0,'기본',125,32,3,0,0,0,0,''),(15,15,0,'기본',75,8,2,0,0,0,0,''),(16,16,0,'기본',65,7,2,0,0,0,0,''),(17,17,0,'기본',405,108,2,0,0,0,0,''),(18,18,0,'기본',250,75,3,0,0,0,0,''),(19,19,0,'기본',385,110,3,0,0,0,0,''),(20,19,1,'기절',120,40,2,0,0,0,0,''),(21,20,0,'기본',320,60,2,0,0,0,0,''),(22,21,0,'기본',330,66,2,0,0,0,0,''),(23,22,0,'기본',240,64,2,0,0,0,0,''),(24,23,0,'기본',240,120,2,1,50,50,4,''),(25,24,0,'기본',270,50,3,8,350,350,3,'세열수류탄'),(26,25,0,'기본',230,115,3,8,225,225,3,''),(27,26,0,'기본',100,50,2,8,150,150,3,''),(28,27,0,'기본',250,150,3,3,0,0,0,''),(29,28,0,'기본',350,70,2,1,50,50,4,''),(30,29,0,'기본',55,5,2,0,0,0,0,''),(31,30,0,'과열 0단계',55,5,2,0,0,0,0,''),(32,30,1,'과열 1단계',70,7,3,0,0,0,0,''),(33,30,2,'과열 2단계',70,7,4,0,0,0,0,''),(34,31,0,'기본',100,50,2,8,100,100,3,''),(35,32,0,'기본',100,50,3,8,75,75,3,''),(36,32,1,'충전',200,100,3,8,300,300,3,''),(37,33,0,'기본',3,3,4,1,50,50,4,''),(38,34,0,'기본',275,90,3,0,0,0,0,''),(39,35,0,'기본',75,15,2,0,0,0,0,''),(40,36,0,'기본',60,5,2,0,0,0,0,''),(41,37,0,'기본',200,70,4,0,0,0,0,''),(42,38,0,'기본',125,32,3,0,0,0,0,''),(43,39,0,'기본',250,50,2,1,50,50,4,''),(44,40,0,'기본',75,38,3,8,75,75,3,''),(45,40,1,'충전',150,75,3,8,225,225,3,''),(46,41,0,'기본',250,250,3,8,400,400,3,''),(47,42,0,'기본',3500,3500,8,8,1000,1000,6,''),(48,43,0,'기본',405,108,2,0,0,0,0,''),(49,44,0,'기본',3,3,4,1,50,50,4,''),(50,45,0,'기본',0,0,0,0,0,0,0,''),(51,46,0,'기본',0,0,0,7,110,55,3,''),(52,47,0,'기본',0,0,0,7,50,25,3,''),(53,48,0,'기본',0,0,0,7,110,55,3,''),(54,49,0,'기본',0,0,0,8,800,800,4,''),(55,50,0,'기본',500,500,3,8,110,35,3,'세열수류탄'),(56,51,0,'기본',300,300,3,1,50,50,4,''),(57,52,0,'기본',0,0,0,8,400,400,4,''),(58,53,0,'기본',150,150,3,1,50,50,4,''),(59,54,0,'기본',0,0,0,0,0,0,0,''),(60,55,0,'기본',0,0,4,0,0,0,0,''),(61,56,0,'기본',150,150,7,8,2000,2000,7,''),(62,57,0,'기본',250,100,3,0,0,0,0,''),(63,58,0,'기본',3,3,6,4,25,25,6,''),(64,59,0,'기본',0,0,0,8,400,400,4,''),(65,60,0,'기본',90,23,3,0,0,0,0,''),(66,61,0,'기본',450,180,4,0,0,0,0,''),(67,62,0,'기본',70,15,2,0,0,0,0,''),(68,63,0,'기본',150,35,4,0,0,0,0,''),(69,64,0,'기본',600,225,5,0,0,0,0,''),(70,64,1,'충전',1500,562,5,0,0,0,0,''),(71,65,0,'기본',2000,2000,6,8,150,150,3,''),(72,66,0,'기본',1100,1100,6,8,150,150,3,''),(73,67,0,'대전차',3200,3200,6,8,150,150,3,''),(74,67,1,'고폭',750,750,5,8,800,800,4,''),(75,68,0,'철갑탄',260,260,4,8,150,150,3,''),(76,68,1,'대공포',150,150,2,8,190,190,3,'세열수류탄'),(77,69,0,'기본',4000,4000,7,8,200,200,3,''),(78,70,0,'기본',20,2,0,8,400,400,3,''),(79,71,0,'기본',350,350,3,8,150,150,3,'집속자탄'),(80,71,1,'자탄정보',150,150,3,8,500,500,3,''),(81,72,0,'기본',200,200,6,8,600,600,3,''),(82,73,0,'기본',4,4,4,1,50,50,4,''),(83,74,0,'기본',350,200,4,1,50,50,4,''),(84,75,0,'기본',2000,2000,6,8,150,150,3,''),(85,76,0,'기본',250,100,7,3,0,0,0,''),(86,77,0,'기본',1,1,5,4,25,25,6,''),(87,80,0,'기본',60,15,3,0,0,0,0,''),(88,81,0,'기본',200,40,2,1,50,50,4,''),(89,82,0,'기본',1,1,5,4,25,25,6,''),(90,91,0,'기본',585,117,2,0,0,0,0,''),(91,90,0,'기본',0,0,0,7,110,55,3,''),(92,83,0,'기본',0,0,0,0,0,0,0,''),(93,84,0,'기본',0,0,0,0,0,0,0,''),(94,85,0,'기본',0,0,0,0,0,0,0,''),(95,79,0,'기본',0,0,0,0,0,0,0,''),(96,78,0,'기본',0,0,0,0,0,0,0,''),(97,86,0,'기본',10000,10000,8,0,0,0,0,''),(98,87,0,'체인건',90,23,3,0,0,0,0,''),(99,87,1,'미사일',1250,1250,6,8,400,400,3,''),(100,88,0,'기본',300,150,5,8,150,150,3,''),(101,89,0,'기본',150,35,4,0,0,0,0,'');
/*!40000 ALTER TABLE `tb_equipment_detail` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-04-16 13:41:32
